# Optional Functionality Utils Is Material Library Available Method

Source: https://www.revitapidocs.com/2026/43baeb41-c3f2-4f9c-9f9b-92bd0b81a158.htm

---

| Optional Functionality Utils Is Material Library Available Method |
| --- |

Checks whether the Material Library is available in the installed Revit.
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static bool IsMaterialLibraryAvailable()
```

```
Public Shared Function IsMaterialLibraryAvailable As Boolean
```

```
public:
static bool IsMaterialLibraryAvailable()
```

```
static member IsMaterialLibraryAvailable : unit -> bool
```

#### Return Value

Boolean
True if the Material Library is available in the installed Revit. See Also

#### Reference

OptionalFunctionalityUtils Class Autodesk.Revit.DB Namespace